bool start = false;

void release(){
  //сбросить полезную нагрузку
}
void parachute(){
  //сбросить парашют
}

void setup() {
  //подключение к периферии
  //выбор канала по умолчанию
  

}

void loop() {
  // если не старт{
  // ожидаем подключения к ЦУПу
  // мигаем
  // если подключились{
  // конфигурируем канал
  // мигаем,пищим, но по другому
  // start = true}
  //}
  // если выста изменяется и start{
  //передаем телеметрию
  //принимаем данные
  //обрабатываем команды}
  // иначеесли пищим, передаем код приземления

}
